Барбершоп/BusinessProcesses/ЗакупкаУПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ЗакупкаУПоставщика</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаПодтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Барбершоп/BusinessProcesses/ЗакупкаУПоставщика/Ext/ObjectModule.bsl
Процедура ОплатаПоставщикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
		
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадачи.Наименование  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + Номенклатура.Наименование +")";
	КонецЦикла;
		
КонецПроцедуры


Процедура ПриемТовараПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого ФормируемаяЗадачи Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадачи.Наименование  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " (Закупка товара: " + Номенклатура.Наименование +")";
	КонецЦикла;

	
КонецПроцедуры


Процедура ОплатаПоставщикуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	БизнесПроцесс = Задача.БизнесПроцесс;
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗакупкаУПоставщика.ТочкиМаршрута.ОплатаПоставщику Тогда
		Отказ = НЕ ЗначениеЗаполнено(Задача.ОплатаПоставщику);
		Если Отказ = Истина Тогда
			Сообщить("Создайте документ ""Расход денежных средств"" и укажите его в задаче! ");
		Иначе
			БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.ОплатаПоставщику = Задача.ОплатаПоставщику;
			БизнесПроцессОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры


Процедура ПоставщикПотвердилПоставкуПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ПоставкаПодтверждена;
	
КонецПроцедуры
